x = float(input())
y = float(input())
xd = x
yd = y
x1 = -7
y1 = 0
x2 = -4
y2 = 0
x3 = -4
y3 = 5
distance_to_point = (x ** 2 + y ** 2) ** 0.5
u = ((y2 - y3) * (x - x3) + (x3 - x2) * (y - y3)) / ((y2 - y3) * (x1 - x3) + (x3 - x2) * (y1 - y3))
v = ((y3 - y1) * (x - x3) + (x1 - x3) * (y - y3)) / ((y2 - y3) * (x1 - x3) + (x3 - x2) * (y1 - y3))
w = 1 - u - v
if distance_to_point > 10:
    print("Вы вышли в море и рискуете быть съеденными акулой!")
if distance_to_point <= 10:
    if 0 <= x <= 5 and 0 <= y <= 5:
        if distance_to_point <= 5:
            print("Опасность! Покиньте зону как можно скорее!")
        else:
            print("Зона безопасна. Продолжайте работу.")
    elif -4 <= x < 0 <= y <= 5:
        print("Опасность! Покиньте зону как можно скорее!")
    elif 0 <= u <= 1 and 0 <= v <= 1 and 0 <= w <= 1:
        print("Опасность! Покиньте зону как можно скорее!")
    elif 0 >= y >= ((0.5 * x + 0.5) ** 2 - 9):
        print("Опасность! Покиньте зону как можно скорее!")
    else:
        print("Зона безопасна. Продолжайте работу.")
